{"backend": "tensorflow", "config": [{"config": {"data_format": "channels_last", "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_7", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_8", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_5", "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_9", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 64, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_10", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 64, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_6", "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_11", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 128, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_12", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 128, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_7", "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_8", "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "bias_constraint": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}