{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "GaussianNoise", "config": {"trainable": true, "stddev": 0.015, "dtype": "float32", "name": "gaussian_noise_1", "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_1", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_2", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_1"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_3", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [2, 2], "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_2"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_4", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [2, 2], "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_3"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "units": 128}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "units": 128}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "units": 7}}], "backend": "tensorflow"}